ghsecuritylab/STM32F7Cube/Projects/STM32746G-Discovery/Applications/USB_Device/AUDIO_Standalone/Src/main.c
// main.c
char* kVersion = "UAC 12am 13/2/18";
//{{{  includes
#include <stdio.h>
#include <stdlib.h>
#include <string.h>

#include "stm32f7xx_hal.h"

#include "usbd_conf.h"
#include "usbd_def.h"
#include "usbd_core.h"
#include "usbd_ioreq.h"

#include "stm32746g_discovery_lcd.h"
#include "stm32746g_discovery_ts.h"
#include "stm32746g_discovery_audio.h"
//}}}
#define AUDIO_CHANNELS     2
#define AUDIO_SAMPLE_RATE  48000
//{{{  packet defines
#define AUDIO_PACKETS               40

#define AUDIO_BYTES_PER_SAMPLE      2
#define AUDIO_PACKETS_PER_SECOND    1000

#define AUDIO_PACKET_SAMPLES        (AUDIO_SAMPLE_RATE / AUDIO_PACKETS_PER_SECOND)
#define AUDIO_PACKET_SIZE           (AUDIO_CHANNELS * AUDIO_PACKET_SAMPLES * AUDIO_BYTES_PER_SAMPLE)

#define AUDIO_MAX_CHANNELS          4
#define AUDIO_MAX_SAMPLE_RATE       48000
#define AUDIO_MAX_PACKET_SAMPLES    (AUDIO_MAX_SAMPLE_RATE / AUDIO_PACKETS_PER_SECOND)
#define AUDIO_MAX_PACKET_SIZE       (AUDIO_MAX_CHANNELS * AUDIO_MAX_PACKET_SAMPLES * AUDIO_BYTES_PER_SAMPLE)

#define AUDIO_SLOTS                 4
#define AUDIO_SLOTS_PACKET_SIZE     (AUDIO_SLOTS * AUDIO_BYTES_PER_SAMPLE * AUDIO_PACKET_SAMPLES)
#define AUDIO_SLOTS_PACKET_BUF_SIZE (AUDIO_PACKETS * AUDIO_SLOTS_PACKET_SIZE)

#define AUDIO_MAX_PACKET_SIZE_DESC  (uint8_t)(AUDIO_MAX_PACKET_SIZE & 0xFF), (uint8_t)((AUDIO_MAX_PACKET_SIZE >> 8) & 0xFF)
//}}}
//{{{  descriptor defines
#define USBD_VID              0x0483
#define USBD_PID              0x5730
#define USBD_LANGID_STRING    0x409
#define USB_SIZ_STRING_SERIAL 0x1A

#define AUDIO_OUT_EP                        0x01

#define AUDIO_DESCRIPTOR_TYPE               0x21
#define USB_DEVICE_CLASS_AUDIO              0x01
#define AUDIO_SUBCLASS_AUDIOCONTROL         0x01
#define AUDIO_SUBCLASS_AUDIOSTREAMING       0x02
#define AUDIO_PROTOCOL_UNDEFINED            0x00
#define AUDIO_STREAMING_GENERAL             0x01
#define AUDIO_STREAMING_FORMAT_TYPE         0x02

// Audio Descriptor Types
#define AUDIO_INTERFACE_DESCRIPTOR_TYPE     0x24
#define AUDIO_ENDPOINT_DESCRIPTOR_TYPE      0x25

// Audio Control Interface Descriptor Subtypes
#define AUDIO_CONTROL_HEADER                0x01
#define AUDIO_CONTROL_INPUT_TERMINAL        0x02
#define AUDIO_CONTROL_OUTPUT_TERMINAL       0x03
#define AUDIO_CONTROL_FEATURE_UNIT          0x06

#define AUDIO_INPUT_TERMINAL_DESC_SIZE      0x0C
#define AUDIO_OUTPUT_TERMINAL_DESC_SIZE     0x09
#define AUDIO_STREAMING_INTERFACE_DESC_SIZE 0x07

#define AUDIO_CONTROL_MUTE         0x01
#define AUDIO_CONTROL_VOLUME       0x02
#define AUDIO_DEFAULT_VOLUME       100

#define AUDIO_FORMAT_TYPE_I        0x01
#define AUDIO_ENDPOINT_GENERAL     0x01
#define AUDIO_REQ_GET_CUR          0x81
#define AUDIO_REQ_SET_CUR          0x01
#define AUDIO_OUT_STREAMING_CTRL   0x02
//}}}
//{{{  graphics, debug
static int oldFaster = 1;
static int writePtrOnRead = 0;
static int debugOffset = 1;
static int debugLine = 0;
static int debugSize = 16;
static char str[40];
//{{{
static void debug (int col) {

  BSP_LCD_SetTextColor (col);
  BSP_LCD_DisplayStringAtLine (debugOffset + (debugLine % debugSize), (uint8_t*)str);
  debugLine++;
  BSP_LCD_ClearStringLine (debugOffset + (debugLine % debugSize));
  }
//}}}
//{{{
static void touch() {

  TS_StateTypeDef TS_State;
  BSP_TS_GetState (&TS_State);
  if (TS_State.touchDetected == 1) {
    if (TS_State.touchWeight[0] > 128)
      BSP_LCD_SetTextColor (LCD_COLOR_GREEN);
    else
      BSP_LCD_SetTextColor (LCD_COLOR_YELLOW);

    BSP_TS_GetState (&TS_State);
    BSP_LCD_FillCircle (TS_State.touchX[0], TS_State.touchY[0], 20);
    }
  }
//}}}
//{{{
static void initGraphics() {

  BSP_LCD_Init();
  BSP_LCD_LayerDefaultInit (1, LCD_FB_START_ADDRESS);
  BSP_LCD_SelectLayer(1);

  BSP_LCD_SetBackColor (LCD_COLOR_BLACK);
  BSP_LCD_SetTextColor (LCD_COLOR_WHITE);
  BSP_LCD_Clear(LCD_COLOR_BLACK);
  BSP_LCD_SetFont (&Font16);
  BSP_LCD_DisplayOn();
  }
//}}}
//}}}

USBD_HandleTypeDef gUsbDevice;
PCD_HandleTypeDef gPcdHandle;
//{{{  interrupt, system handlers
void NMI_Handler() {}
void SVC_Handler() {}
void PendSV_Handler() {}
void DebugMon_Handler() {}

void BusFault_Handler() { while (1) {} }
void HardFault_Handler() { while (1) {} }
void MemManage_Handler() { while (1) {} }
void UsageFault_Handler() { while (1) {} }

void SysTick_Handler() { HAL_IncTick(); }

extern SAI_HandleTypeDef haudio_out_sai;
void DMA2_Stream4_IRQHandler() { HAL_DMA_IRQHandler (haudio_out_sai.hdmatx); }
//}}}
//{{{  usbd pcd handler
void OTG_FS_IRQHandler() { HAL_PCD_IRQHandler (&gPcdHandle); }
void OTG_HS_IRQHandler() { HAL_PCD_IRQHandler (&gPcdHandle); }

//{{{
void HAL_PCD_MspInit (PCD_HandleTypeDef* pcdHandle)
{
  GPIO_InitTypeDef GPIO_InitStruct;

  if (pcdHandle->Instance == USB_OTG_FS) {
    /* Configure USB FS GPIOs */
    __HAL_RCC_GPIOA_CLK_ENABLE();

    /* Configure DM DP Pins */
    GPIO_InitStruct.Pin = (GPIO_PIN_11 | GPIO_PIN_12);
    GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    GPIO_InitStruct.Speed = GPIO_SPEED_HIGH;
    GPIO_InitStruct.Alternate = GPIO_AF10_OTG_FS;
    HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

    /* Enable USB FS Clock */
    __HAL_RCC_USB_OTG_FS_CLK_ENABLE();

    /* Set USBFS Interrupt priority */
    HAL_NVIC_SetPriority(OTG_FS_IRQn, 5, 0);

    /* Enable USBFS Interrupt */
    HAL_NVIC_EnableIRQ(OTG_FS_IRQn);
    }

  else if(pcdHandle->Instance == USB_OTG_HS) {
    /* Configure USB FS GPIOs */
    __HAL_RCC_GPIOA_CLK_ENABLE();
    __HAL_RCC_GPIOB_CLK_ENABLE();
    __HAL_RCC_GPIOC_CLK_ENABLE();
    __HAL_RCC_GPIOH_CLK_ENABLE();

    /* CLK */
    GPIO_InitStruct.Pin = GPIO_PIN_5;
    GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    GPIO_InitStruct.Speed = GPIO_SPEED_HIGH;
    GPIO_InitStruct.Alternate = GPIO_AF10_OTG_HS;
    HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

    /* D0 */
    GPIO_InitStruct.Pin = GPIO_PIN_3;
    GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    GPIO_InitStruct.Speed = GPIO_SPEED_HIGH;
    GPIO_InitStruct.Alternate = GPIO_AF10_OTG_HS;
    HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

